src/cf/Catalogs/СкриптыСхемДляКомплексныхПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СкриптыСхемДляКомплексныхПроцессов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешВыражения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/СкриптыСхемДляКомплексныхПроцессов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Вычисляет выражение условия и возвращает результат.
// 
// Параметры:
//  СкриптСхемы - СправочникСсылка.СкриптыСхемДляКомплексныхПроцессов
//  Процесс - БизнесПроцессОбъект.КомплексныйПроцесс
//
Процедура ВыполнитьСкриптСхемы(СкриптСхемы, Процесс) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ПроцессОбъект", Процесс);
	
	Выражение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СкриптСхемы, "Выражение");	
	ОбщегоНазначения.ВыполнитьВБезопасномРежиме(Выражение, Параметры);
		
КонецПроцедуры

// Возвращает скрипт схемы по хешу выражения.
// 
// Параметры:
//  ХешВыражения - Строка
// 
// Возвращаемое значение:
//  СправочникСсылка.СкриптыСхемДляКомплексныхПроцессов
//
Функция СкриптСхемыПоХешуВыражения(ХешВыражения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СкриптыСхемДляКомплексныхПроцессов.Ссылка
		|ИЗ
		|	Справочник.СкриптыСхемДляКомплексныхПроцессов КАК СкриптыСхемДляКомплексныхПроцессов
		|ГДЕ
		|	СкриптыСхемДляКомплексныхПроцессов.ХешВыражения = &ХешВыражения";
	Запрос.УстановитьПараметр("ХешВыражения", ХешВыражения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.СкриптыСхемДляКомплексныхПроцессов.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
#КонецОбласти

#КонецЕсли
